<a href="https://colab.research.google.com/github/sajid-munawar/Data_Cleaning_with_python/blob/main/Solution_Notebook_Data_Cleaning_with_Python_Irrelevant_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<font color="blue">To use this notebook on Colaboratory, you will need to make a copy of it. Go to File > Save a Copy in Drive. You can then use the new copy that will appear in the new tab.</font>

# Practice Notebook: Data Cleaning with Python - Irrelevant Data

## 3. Irrelevant Data

#### <font color="blue">Pre-requisites</font>

In [ ]:
# Pre-requisites
# ---
# Importing pandas library
# ---
# OUR CODE GOES BELOW
# 
import pandas as pd

import numpy as np

#### <font color="blue">Examples</font>

##### <font color="blue">Example 1</font>

In [ ]:
# Example 1
# --- 
# Deleting irrelevant columns
# ---
# Dataset url = http://bit.ly/SampleDataset
# ---
# OUR CODE GOES BELOW
# 

# Loading our dataset 
# ---
#
df = pd.read_csv('http://bit.ly/SampleDataset')

# Previewing our dataset 
# ---
# 
df.head()

                NAME        CITY  ... ACCOUNT B  TOTAL ACCOUNT
0          Adi Dako   LISBON      ...      4340           6730
1          John Paul   LONDON     ...     34334          38834
2        Cindy Jules   Stockholm  ...      5504           8949
3      Arthur Kegels    BRUSSELS  ...      8999            300
4      Freya Bismark      Berlin  ...     19000          26000

[5 rows x 8 columns]

In [ ]:
# Determining the size of our dataset (records, columns)
# ---
# 
df.shape

(8, 8)

In [ ]:
# Deleting an Irrelevant Column i.e. if we didn't require the column CITY 
# to answer our research question.
# ---
# 

# Dropping/Deleting those two columns, we also note:
# a) We set axis = 1: A dataframe has two axes: “axis 0” and “axis 1”. 
# “axis 0” represents rows and “axis 1” represents columns.
# b)-> Inplace = True: This would mean the changes would be made in the original dataframe
# ---
# 

# Dropping the irrelevant columns i.e. Team and Weight
# Those values were dropped since axis was set equal to 1 and 
# the changes were made in the original data frame since inplace was True.
df.drop(["CITY"], axis = 1, inplace = True) 
 
# Previewing our resulting dataset
# ---
# 
df.head()

                NAME         COUNTRY  ...  ACCOUNT B  TOTAL ACCOUNT
0          Adi Dako    PORTUGAL       ...       4340           6730
1          John Paul  UNITED KINGDOM  ...      34334          38834
2        Cindy Jules          Sweden  ...       5504           8949
3      Arthur Kegels         BELGIUM  ...       8999            300
4      Freya Bismark        GERMANYY  ...      19000          26000

[5 rows x 7 columns]

In [ ]:
# We can drop multiple columns as shown
# ---
# 
df.drop(["HEIGHT", "WEIGHT"], axis = 1, inplace = True) 

# Previewing our resulting dataset 
# --- 
# 
df.head()

                NAME         COUNTRY  ACCOUNT A  ACCOUNT B  TOTAL ACCOUNT
0          Adi Dako    PORTUGAL          2390.0       4340           6730
1          John Paul  UNITED KINGDOM     4500.0      34334          38834
2        Cindy Jules          Sweden        NaN       5504           8949
3      Arthur Kegels         BELGIUM     4344.0       8999            300
4      Freya Bismark        GERMANYY     7000.0      19000          26000

##### <font color="blue">Example 2</font>

In [ ]:
# Example 2
# ---
# In-record & cross-datasets errors
# -> Such errors result from having two or more values in the same row or across datasets 
# contradicting with each other
# ---
# Dataset = http://bit.ly/SampleDataset
# ---
# OUR CODE GOES BELOW
# 

df['TOTAL ACCOUNT 2'] = df['ACCOUNT A'] + df['ACCOUNT B']


# Previewing our resulting dataset 
# ---
#
df.head()

                NAME         COUNTRY  ...  TOTAL ACCOUNT  TOTAL ACCOUNT 2
0          Adi Dako    PORTUGAL       ...           6730           6730.0
1          John Paul  UNITED KINGDOM  ...          38834          38834.0
2        Cindy Jules          Sweden  ...           8949              NaN
3      Arthur Kegels         BELGIUM  ...            300          13343.0
4      Freya Bismark        GERMANYY  ...          26000          26000.0

[5 rows x 6 columns]

In [ ]:
# Create another column to tell us whether if the two columns match.
# We will use the numpy library through use of np.
# ---
# 
df['TOTAL ACCOUNT?'] = np.where(df['TOTAL ACCOUNT'] == df['TOTAL ACCOUNT 2'], 'True', 'False')

# Previewing our resulting dataset 
# ---
# 
df.head()

                NAME         COUNTRY  ...  TOTAL ACCOUNT 2  TOTAL ACCOUNT?
0          Adi Dako    PORTUGAL       ...           6730.0            True
1          John Paul  UNITED KINGDOM  ...          38834.0            True
2        Cindy Jules          Sweden  ...              NaN           False
3      Arthur Kegels         BELGIUM  ...          13343.0           False
4      Freya Bismark        GERMANYY  ...          26000.0            True

[5 rows x 7 columns]

In [ ]:
# Let's now select the records which don't match 
# ---
# 
df.loc[df['TOTAL ACCOUNT?'] == "False"]

                NAME  COUNTRY  ...  TOTAL ACCOUNT 2  TOTAL ACCOUNT?
2        Cindy Jules   Sweden  ...              NaN           False
3      Arthur Kegels  BELGIUM  ...          13343.0           False
5         Rena Filip   BRAZIL  ...           8998.0           False

[3 rows x 7 columns]

In [ ]:
# At this point we can do several things
# -> Correct the values,
# -> Drop/Delete the values,
# -> Or even decide to leave them as they are for certain reasons
# ---
# If we had a large dataset, we could get the no. of records using len(),
# this would help us in our decision making process.
# ---
# 
len(df.loc[df['TOTAL ACCOUNT?'] == "False"])

3

#### <font color="green">Challenges</font>

##### <font color="green">Challenge 1</font>

In [ ]:
# Challenge 1
# ---
# Question: While perfoming some analysis for Project X, we realize that we don't need the team 
# and weight columns in our dataset. Your task is to drop those two columns below.
# ---
# Dataset url = http://bit.ly/NBABasketballDataset
# ---
# OUR CODE GOES BELOW
# 

# ---
#
nba_df = pd.read_csv('http://bit.ly/NBABasketballDataset')
nba_df.head()

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN
3    R.J. Hunter   oston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                NaN  5000000.0

[5 rows x 9 columns]

In [ ]:
# Dropping those two columns
# ---
#
nba_df.drop(["Height", "Weight"], axis = 1, inplace = True) 
nba_df.head()

            Name            Team  Number  ...   Age            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  25.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  25.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  27.0  Boston University        NaN
3    R.J. Hunter   oston Celtics    28.0  ...  22.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  29.0                NaN  5000000.0

[5 rows x 7 columns]

##### <font color="green">Challenge 2</font>

In [ ]:
# Challenge 2
# ---
# Question: Check for in-record and cross-dataset errors given the following dataset
# Hint: 
# -> Perform other data cleaning techniques that you have learned so far for ease of working.
# -> Total_Budget_Supported__by_Donors_KES = Total_-_Loan_Budget_Est_KES + Total_-_Grant_Budget_Est_KES
# ---
# Dataset url = http://bit.ly/GVProjectsFundingDataset
# ---
# OUR CODE GOES BELOW
#

In [ ]:
# Loading our dataset
# ---
# 
gv_df2 = pd.read_csv('http://bit.ly/GVProjectsFundingDataset')
gv_df2.head()

   Total_-_GOK_Budget_Est_KES  ...  OBJECTID
0                   111285239  ...         0
1                  2009277440  ...         1
2                    50034000  ...         2
3                 24267555932  ...         3
4                  1160000000  ...         4

[5 rows x 7 columns]

#df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_').str.replace('_-', '_').str.replace('__', '_').str.replace('(', '').str.replace(')', '')
#df.head()

In [ ]:
# Renaming our columns
# ---
# 
gv_df2.columns = gv_df2.columns.str.strip().str.lower().str.replace(' ', '_').str.replace('_-', '_').str.replace('__', '_').str.replace('(', '').str.replace(')', '')
gv_df2.head()

   total_gok_budget_est_kes  ...  objectid
0                 111285239  ...         0
1                2009277440  ...         1
2                  50034000  ...         2
3               24267555932  ...         3
4                1160000000  ...         4

[5 rows x 7 columns]

In [ ]:
# Checking for in dataset errors
# ---
# 
gv_df2['total_budget_supported_by_donors_kes_2'] = gv_df2['total_loan_budget_est_kes'] + gv_df2['total_grant_budget_est_kes']

# Previewing our resulting dataset 
# ---
#
gv_df2.head()

   total_gok_budget_est_kes  ...  total_budget_supported_by_donors_kes_2
0                 111285239  ...                              2709690025
1                2009277440  ...                              8880417037
2                  50034000  ...                              1705540000
3               24267555932  ...                            145899000000
4                1160000000  ...                              2685000000

[5 rows x 8 columns]

In [ ]:
# Creating another column to tell us whether if the two columns match
# ---
# 
gv_df2['total_budget_supported_by_donors_kes_2?'] = np.where(gv_df2['total_budget_supported_by_donors_kes_2'] == gv_df2['total_budget_supported_by_donors_kes'], 'True', 'False')

# Previewing our resulting dataset 
# ---
# 
gv_df2.head()

   total_gok_budget_est_kes  ...  total_budget_supported_by_donors_kes_2?
0                 111285239  ...                                     True
1                2009277440  ...                                     True
2                  50034000  ...                                     True
3               24267555932  ...                                     True
4                1160000000  ...                                     True

[5 rows x 9 columns]

In [ ]:
# Let's now select the records which don't match 
# ---
# 
gv_df2.loc[gv_df2['total_budget_supported_by_donors_kes_2?'] == "False"]

    total_gok_budget_est_kes  ...  total_budget_supported_by_donors_kes_2?
12                2500000000  ...                                    False
13                1250000000  ...                                    False
23                  90000000  ...                                    False
28                  10000000  ...                                    False
36                         0  ...                                    False

[5 rows x 9 columns]

In [ ]:
# At this point we can do several things
# -> Correct the values,
# -> Drop/Delete the values,
# -> Or even decide to leave them as they are for certain reasons
# ---
# How many are these records?
# ---
# 
len(gv_df2.loc[gv_df2['total_budget_supported_by_donors_kes_2?'] == "False"])

5